Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Android vitals can alert you that the problem is occurring, and diagnostic tools can help you diagnose the problem.
zh_cn: Android vitals 可以提醒你问题正在发生，诊断工具可以帮助你诊断问题。

source: Android vitals can help improve your app's performance by alerting you, via the Play Console, when your app's startup times are excessive.
zh_cn: 当你的应用程序的启动时间过长时，Android vitals 可以通过 Play Console 提醒你，从而帮助提高应用程序的性能。

source: Android vitals considers your app's startup times excessive when the app's:
zh_cn: Android vitals 认为你的应用程序的启动时间过长，当应用程序在以下情况时：

source: Android vitals doesn't report data for hot startups.
zh_cn: Android vitals 不报告 hot 启动的数据。

source: Android will automatically change the image based on the state of the button and the corresponding images defined in the XML.
zh_cn: Android 将根据按钮的状态和 XML 中定义的相应图像自动更改图像。

source: Animate a scroll by the given amount of pixels along either axis.
zh_cn: 通过给定的各坐标轴的像素值，来进行平滑的滚动。

source: Animation
zh_cn: 动画

source: Annotation which allows marking of views to be decoration views when added to a view pager.
zh_cn: 注解，允许在添加到 view pager 时将 view 标记为装饰 view。

source: Annotations should precede other modifiers for the same language element.
zh_cn: 注释应该位于同一语言元素的其他修饰符之前。

source: Another very expensive operation is traversing layouts.
zh_cn: 另一个非常昂贵的操作是遍历布局。

source: Any MaterialButtons added to this view group are automatically marked as checkable, and by default multiple buttons within the same group can be checked.
zh_cn: 添加到此 view 组的任何 MaterialButton 将自动标记为 checkable，默认情况下，可以选中同一组中的多个按钮。

source: Any change you make to the default margin applies only to the views you add from then on.
zh_cn: 你对默认边距所做的任何更改仅适用于你之后添加的 view。

source: Any child views which are set to dodge the same inset edges by CoordinatorLayout.LayoutParams.dodgeInsetEdges will be moved appropriately so that the views do not overlap.
zh_cn: 通过 CoordinatorLayout.LayoutParams.dodgeInsetEdges 设置为闪避相同内缩边缘的任何子 view 都将被适当移动，以使 view 不重叠。

source: Any child views which are set to dodge the same inset edges by dodgeInsetEdges will be moved appropriately so that the views do not overlap.
zh_cn: 通过 dodgeInsetEdges 设置为躲避相同插入边缘的任何子 view 都将被适当移动，以使 view 不重叠。

source: Any content drawn by this method will be drawn after the item views are drawn and will thus appear over the views.
zh_cn: 该方法绘制的任何内容将在 item views 绘制之后被绘制，因此将显示在 views 的上层。

source: Any content drawn by this method will be drawn before the item views are drawn, and will thus appear underneath the views.
zh_cn: 该方法绘制的任何内容将在 item views 绘制之前被绘制，因此将显示在 views 的下层。

source: Any disk I/O, deserialization, or tight loops that might be occurring during the bottleneck.
zh_cn: 在瓶颈期间可能发生的任何磁盘 I/O，反序列化或紧密循环。

source: Any exception thrown by the finalize method causes the finalization of this object to be halted, but is otherwise ignored.
zh_cn: 由 finalize 方法抛出的任何异常都会导致此对象的终止被暂停，但会被忽略。

source: Any global singleton objects it initializes.
zh_cn: 它初始化的任何全局单例对象。

source: Any global singleton objects your app initializes.
zh_cn: 你的应用初始化的任何全局单例对象。

source: Any logging that is meant to be read by other people and to be available in release builds should be terse without being cryptic, and should be reasonably understandable.
zh_cn: 任何供其他人阅读并且在发布版本中提供的日志记录都应当简洁明了、合理易懂。

source: Any non-negative integer smaller than or equal to the value returned by this method is guaranteed to be a valid group index for this matcher.
zh_cn: 任何小于等于由此方法返回的值的非负整数保证是此匹配器的有效组索引。

source: Any string building will be stripped out of release builds and needs to appear inside the if (LOCAL_LOGV) block.
zh_cn: 所有字符串编译都将从发布版本中删除，并且需要在 if (LOCAL_LOGV) 块中显示。

source: Any time a user hits a directional key, such as a D-pad direction, the view device will exit touch mode, and find a view to take focus, so that the user may resume interacting with the user interface without touching the screen again.
zh_cn: 任何时候用户按下方向键，比如 D-pad 方向，设备将会退出 touch mode，并寻找一个 view 来取得焦点，这样用户可以在不触屏的的情况下继续与用户界面交互。

source: Any time a view calls requestLayout(), the Android UI system needs to traverse the entire view hierarchy to find out how big each view needs to be.
zh_cn: 每当 view 调用 requestLayout() 时，Android UI 系统都需要遍历整个 view 层次结构，以找出每个 view 需要的大小。

source: Any undecoded lines in the image will be blank.
zh_cn: 图像中任何未解码的行都将为空白。

source: Any value <= 1 is treated the same as 1.
zh_cn: 任何值 <= 1 的处理都与 1 相同。

source: Any views which are inset on the same edge as this view is set to dodge will result in this view being moved so that the views do not overlap.
zh_cn: 在此 view 设置为闪避的同一边缘上插入的任何 view 将导致移动此 view，以使 view 不重叠。

source: App developers may follow the standard of their choosing, such as the Google Java Style Guide.
zh_cn: 应用程序开发人员可以遵守自己的选择标准，如 Google Java Style Guide 。

source: App launch can take place in one of three states, each affecting how long it takes for your app to become visible to the user: cold start, warm start, or hot start.
zh_cn: 应用程序启动可以在三种状态之一中进行，每种状态都会影响应用程序对用户可见所需的时间：冷启动（cold start），温启动（warm start）或热启动（hot start）。

source: AppBarLayout also requires a separate scrolling sibling in order to know when to scroll.
zh_cn: AppBarLayout 还需要一个单独的滚动同级 view，以便知道何时滚动。

source: AppBarLayout is a vertical LinearLayout which implements many of the features of material designs app bar concept, namely scrolling gestures.
zh_cn: AppBarLayout 是一个垂直 LinearLayout，它实现了材料设计 app bar 概念的许多功能，即滚动手势。

source: Append the specified arc to the path as a new contour.
zh_cn: 将指定的弧作为新轮廓附加到路径。

source: Application creation
zh_cn: Application 创建

source: Applications should save and restore these on their own in Activity.onSaveInstanceState(Bundle) and Activity.onRestoreInstanceState(Bundle).
zh_cn: 应用程序应在 Activity.onSaveInstanceState(Bundle) 和 Activity.onRestoreInstanceState(Bundle) 中自行保存和恢复这些内容。

source: Applications that wish to populate the toolbar's menu can do so from here.
zh_cn: 希望填充工具栏菜单的应用程序可以从此处执行此操作。

source: Apply Custom Attributes
zh_cn: 应用自定义属性

source: Apply a property transformation to the given page.
zh_cn: 对特定的页面应用属性转换。

source: Apply the constraints to a ConstraintLayout.
zh_cn: 将约束应用于 ConstraintLayout。

source: Apply the retrieved attribute values to your view
zh_cn: 将获取到的属性值应用于 view

source: Appropriate uses of SlidingPaneLayout include pairings of panes such as a contact list and subordinate interactions with those contacts, or an email thread list with the content pane displaying the contents of the selected thread.
zh_cn: SlidingPaneLayout 的适当使用包括窗格的配对，例如联系人列表和与这些联系人的下级交互，或者电子邮件线程列表，其中内容窗格显示所选线程的内容。

source: Apps targeting SDK version 18 or newer will receive the correct behavior
zh_cn: 针对 SDK 版本 18 或更高版本的应用将获得正确的行为

source: Apps using a logo should also supply a description using setLogoDescription(int).
zh_cn: 使用 logo 的应用也应使用 setLogoDescription(int) 提供说明。

source: Apps wishing to express a stronger branding should use their brand colors heavily in the action bar and other application chrome or use a logo in place of their standard title text.
zh_cn: 希望表达更强品牌的应用应在操作栏和其他应用程序 chrome 中大量使用其品牌颜色，或使用 logo 代替其标准标题文本。

source: ArrayMap is a generic key->value mapping data structure that is designed to be more memory efficient than a traditional HashMap.
zh_cn: ArrayMap 是一个泛型的 键->值 映射数据结构，它的设计比传统的 HashMap 更节省内存。

source: ArraySet is a generic set data structure that is designed to be more memory efficient than a traditional HashSet.
zh_cn: ArraySet 是一种泛型的 set 数据结构，它的设计比传统的 HashSet 更节省内存。

source: As a container for a specific interaction with one or more child views
zh_cn: 作为与一个或多个子 view 进行特定交互的容器

source: As a convenience, methods are also provided for returning these captured subsequences in string form.
zh_cn: 出于方便的考虑，还提供了以字符串的形式返回这些已捕获子序列的方法。

source: As a last resort, if you are confident that ignoring the exception is appropriate then you may ignore it, but you must also comment why with a good reason:
zh_cn: 最后一种方案：如果你确信忽略异常是合适的处理方式，那么你可以忽略异常，但你必须添加备注以充分说明理由：

source: As a remedy, the framework offers a touch filtering mechanism that can be used to improve the security of views that provide access to sensitive functionality.
zh_cn: 作为补救，框架提供了一种触摸过滤机制用于提高用于进入敏感功能的 view 的安全性。

source: As a result of the previous snippet, getUriForFile() returns the content URI content://com.mydomain.fileprovider/my_images/default_image.jpg.
zh_cn: 由于前面的片段， getUriForFile() 返回 content URI content://com.mydomain.fileprovider/my_images/default_image.jpg 。

source: As a result, calls to getParent() on children of the MaterialCardView, will not return the MaterialCardView itself, but rather an intermediate View.
zh_cn: 因此，对 MaterialCardView 的子项调用 getParent() 将不会返回 MaterialCardView 本身，而是返回中间 view。

source: As a result, calls to getParent() on children of the TextInputLayout -- such as a TextInputEditText -- may not return the TextInputLayout itself, but rather an intermediate View.
zh_cn: 因此，对 TextInputLayout 的子项（例如 TextInputEditText）调用 getParent() 可能不会返回 TextInputLayout 本身，而是返回中间 view。

source: As a result, the system executes the code you write in onClick(View) after the user presses the button.
zh_cn: 因此，系统会在用户按下按钮后执行你在 onClick(View) 中编写的代码。

source: As a result, the view will not receive touches whenever a toast, dialog or other window appears above the view's window.
zh_cn: 这样，当 toast，dialog 或其他 window 在 view 的 window 之上时，view 将不会收到触摸事件。

source: As a top-level application decor or chrome layout
zh_cn: 作为顶级应用程序装饰或 chrome 布局

source: As a workaround to enable correct color theming in your app for API < 23, in addition to setting the colorOnSurface attribute in your theme, redefine mtrl_on_surface_emphasis_medium to match with the correct opacity.
zh_cn: 作为在应用中为 API < 23 启用正确颜色主题的解决方法，除了在主题中设置 colorOnSurface 属性外，还要重新定义 mtrl_on_surface_emphasis_medium 以匹配正确的不透明度。

source: As always, the super is called first.
zh_cn: 和往常一样，先调用父类方法。

source: As an example, the NotePad application demonstrates many aspects of using the Android platform.
zh_cn: 例如， NotePad application 演示了使用 Android 平台的许多方面。

source: As an optimization, these values are stored as packed integers, and you use the static methods of View.MeasureSpec to unpack the information stored in each integer.
zh_cn: 作为优化，这些值存储为压缩整数，并使用 View.MeasureSpec 的静态方法来解压缩存储在每个整数中的信息。

source: As another example, the following code snippet uses the "dialog_exit" ID as a unique identifier for a dialog:
zh_cn: 作为另一个示例，以下代码段使用 "dialog_exit" ID 作为对话框的唯一标识符：

source: As both the JDK and the Android code bases are very inconsistent around acronyms, it is virtually impossible to be consistent with the surrounding code.
zh_cn: 由于 JDK 和 Android 代码库在首字母缩写词上非常不一致，几乎也不可能与周围的代码保持一致。

source: As mentioned earlier, this is the view's responsibility.
zh_cn: 如前所述，这是 view 的责任。

source: As of KITKAT, any mutable bitmap can be reused by BitmapFactory to decode any other bitmaps as long as the resulting byte count of the decoded bitmap is less than or equal to the allocated byte count of the reused bitmap.
zh_cn: 从 KITKAT 开始，任何可变位图都可以被 BitmapFactory 重用，以解码任何其他位图，只要解码位图的 byte count 小于或等于重用位图的 allocated byte count。

source: As of LOLLIPOP, this is ignored.
zh_cn: 从 LOLLIPOP，这被忽略。

source: As of N, see comments on requestCancelDecode().
zh_cn: 从 N 中，请参阅 requestCancelDecode() 上的注释。

source: As of N, this is ignored.
zh_cn: 从 N，这被忽略。

source: As of N, this will not affect the decode, though it will still set mCancel.
zh_cn: 从 N，这不会影响解码，尽管它仍然会设置 mCancel。

source: As of API 21, GridLayout's distribution of excess space accomodates the principle of weight.
zh_cn: 从 API 21 开始，GridLayout 分配的多余空间适应了权重原则。

source: As part of the build process, the SDK tools generate symbols for each resource, which you can use in your application code to access the resources.
zh_cn: 作为构建过程的一部分，SDK 工具为每个资源生成符号，你可以在应用程序代码中使用这些符号来访问资源。

source: As per the Android Design guide, any drawers positioned to the left/start should always contain content for navigating around the application, whereas any drawers positioned to the right/end should always contain actions to take on the current content.
zh_cn: 根据 Android Design guide，位于左侧/开始位置的任何抽屉应始终包含用于在应用程序周围导航的内容，而位于右侧/末端的任何抽屉应始终包含要对当前位置执行的操作内容。

source: As property animation is only supported as of Android 3.0 and forward, setting a PageTransformer on a ViewPager on earlier platform versions will be ignored.
zh_cn: 由于属性动画仅支持 Android 3.0 及以后的版本，因此在早期平台版本上给 ViewPager 设置 PageTransformer 将被忽略。

source: As soon as the system creates the app process, the app process is responsible for the next stages:
zh_cn: 一旦系统创建了应用程序进程，应用程序进程就会负责以下阶段：

source: As such, it is possible and recommended to provide two different formatting patterns: one to display the date/time in 24-hour mode and one to display the date/time in 12-hour mode.
zh_cn: 因此，可以并且建议提供两种不同的格式化模式：一种用于以 24 小时模式显示日期/时间，另一种用于以 12 小时模式显示日期/时间。

source: As such, you can combine ID resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以在一个 <resources> 元素下将 ID 资源与一个 XML 文件中的其他简单资源相结合。

source: As such, you can combine bool resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以将 bool 资源与一个 XML 文件中的其他简单资源组合在一个 <resources> 元素下。

source: As such, you can combine color resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以在一个 <resources> 元素下将颜色资源与一个 XML 文件中的其他简单资源相结合。

source: As such, you can combine dimension resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以在一个 <resources> 元素下将尺寸资源与一个 XML 文件中的其他简单资源相结合。

source: As such, you can combine integer array resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以将整数数组资源与一个 XML 文件中的其他简单资源组合在一个 <resources> 元素下。

source: As such, you can combine integer resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以将整数资源与一个 XML 文件中的其他简单资源组合在一个 <resources> 元素下。

source: As such, you can combine typed array resources with other simple resources in the one XML file, under one <resources> element.
zh_cn: 因此，你可以在一个 <resources> 元素下将类型化数组资源与一个 XML 文件中的其他简单资源相结合。

source: As this class descends from ImageView, you can control the icon which is displayed via setImageDrawable(Drawable).
zh_cn: 当此类是 ImageView 的后代，你可以通过 setImageDrawable(Drawable) 控制显示的图标。

source: As this class descends from MaterialButton, you can control the icon which is displayed via setIcon(android.graphics.drawable.Drawable), and the text via setText(CharSequence).
zh_cn: 此类继承 MaterialButton，你可以通过 setIcon(android.graphics.drawable.Drawable) 控制显示的图标，通过 setText(CharSequence) 控制文本。

source: As with AppBarLayout's scrolling, this method relies on this layout being a direct child of a CoordinatorLayout.
zh_cn: 与 AppBarLayout 的滚动一样，此方法依赖于此布局是 CoordinatorLayout 的直接子代。

source: Assign the pointer to the least recently added target.
zh_cn: 将指针分配给最近添加的目标。

source: Associate a Behavior-specific tag object with the given child view.
zh_cn: 将特定于行为的标记对象与给定的子 view 相关联。

source: Assumes sRGB encoding.
zh_cn: 假设 sRGB 编码。

source: At a high level, implementing onMeasure() looks something like this:
zh_cn: 高度概括来看，实现 onMeasure() 方法看起来是这样的：

source: At least one axis (X or Y) will fit exactly.
zh_cn: 至少一个轴(X 或 Y)将精确匹配。

source: At that point, the system process swaps out the starting window for your app, allowing the user to start interacting with the app.
zh_cn: 此时，系统进程会交换应用程序的启动窗口，允许用户开始与应用程序进行交互。

source: At the beginning of a cold start, the system has three tasks.
zh_cn: 在冷启动开始时，系统有三个任务。

source: At the end of the measure pass, every view has stored its measurements.
zh_cn: 在测量过程的结尾，每个 view 都保存了它的测量结果。

source: At this point you must ensure that all of the pages have actually been added or removed from the container as appropriate.
zh_cn: 此时，你必须确保所有页面实际上已经从容器中添加或删除。

source: At this point, the user can start using the app.
zh_cn: 此时，用户可以开始使用该应用程序。

source: Attaching
zh_cn: 附加

source: Attempting to combine them will throw an IllegalStateException.
zh_cn: 尝试组合它们将抛出 IllegalStateException。

source: Attempting to decode a mutable Drawable will throw an IllegalStateException.
zh_cn: 尝试解码可变 Drawable 将抛出 IllegalStateException。

source: Attempts to find the next subsequence of the input sequence that matches the pattern.
zh_cn: 尝试查找与该模式匹配的输入序列的下一个子序列。

source: Attempts to get the ViewHolder for the given position, either from the Recycler scrap, cache, the RecycledViewPool, or creating it directly.
zh_cn: 尝试获取给定位置的 ViewHolder，可能从 Recycler scrap、缓存、RecycledViewPool 或直接创建。

source: Attempts to match the entire region against the pattern.
zh_cn: 尝试将整个区域与模式匹配。

source: Attempts to match the input sequence, starting at the beginning of the region, against the pattern.
zh_cn: 尝试将从区域开头开始的输入序列与该模式匹配。

source: Attributes are a powerful way of controlling the behavior and appearance of views, but they can only be read when the view is initialized.
zh_cn: 属性是控制 view 行为和外观的强大方法，但只能在初始化 view 时读取它们。

source: Autoconnect does not create constraints to other views in the layout.
zh_cn: Autoconnect 不会对布局中的其他 views 创建约束。

source: Autoconnect is a separate feature that is either on or off.
zh_cn: 自动连接是一个单独的功能，可以打开或关闭。

source: Autoconnect is disabled by default.
zh_cn: 默认情况下禁用 Autoconnect。

source: Autofill type for a field that contains a date, which is represented by a long representing the number of milliseconds since the standard base time known as "the epoch", namely January 1, 1970, 00:00:00 GMT (see Date.getTime().
zh_cn: 包含日期的字段的自动填充类型，由表示自标准基准时间（称为“纪元”）以来的毫秒数的长度表示，即 1970 年 1 月 1 日，格林威治标准时间 00:00:00（参见 Date.getTime()。

source: Autofill type for a selection list field, which is filled by an int representing the element index inside the list (starting at 0).
zh_cn: 选择列表字段的自动填充类型，由 int 填充，表示列表中的元素索引(从 0 开始)。

source: Autofill type for a text field, which is filled by a CharSequence.
zh_cn: 文本字段的自动填充类型，由 CharSequence 填充。

source: Autofill type for a togglable field, which is filled by a boolean.
zh_cn: 自动填充类型，用于可切换字段，由 boolean 填充。

source: Autofill type for views that cannot be autofilled.
zh_cn: 自动填充类型，用于无法自动填充的 view。

source: Automatically create constraints
zh_cn: 自动创建约束

source: Automatically determine whether a view is important for accessibility.
zh_cn: 自动确定 view 是否对可访问性很重要。

source: Automatically determine whether a view is important for autofill.
zh_cn: 自动确定 view 对自动填充是否重要。

source: Avoid enumerations
zh_cn: 避免使用枚举

source: Avoid extracting native libraries
zh_cn: 避免提取 native 库

source: Avoid performing expensive operations such as layout during animation as it can cause stuttering; try to perform expensive operations during the STATE_IDLE state.
zh_cn: 避免在动画期间执行昂贵的操作，例如布局，因为它可能导致缓慢；尝试在 STATE_IDLE 状态期间执行昂贵的操作。

source: Background drawable to use for the dropdown in spinnerMode="dropdown".
zh_cn: drawable 的背景用于 spinnerMode =“dropdown” 中的下拉列表。

source: Bad
zh_cn: 不佳

source: Base class for a AdapterView that will perform animations when switching between its views.
zh_cn: AdapterView 的基本类，在其 view 之间切换时将执行动画。

source: Base class for a FrameLayout container that will perform animations when switching between its views.
zh_cn: FrameLayout 容器的基类，在其 view 之间切换时将执行动画。

source: Base class for an Adapter
zh_cn: 适配器基类

source: Base class for derived classes that want to save and restore their own state in View.onSaveInstanceState().
zh_cn: 要在 View.onSaveInstanceState() 中保存和恢复其自身状态的派生类的基类。

source: Base class for smooth scrolling.
zh_cn: 平滑滚动的基类。

source: Base class that can be used to implement virtualized lists of items.
zh_cn: 可用于实现项目虚拟化列表的基类。

source: Based on the formula for relative luminance defined in WCAG 2.0, W3C Recommendation 11 December 2008.
zh_cn: 基于 WCAG 2.0 中定义的相对亮度公式，W3C 2008 年 12 月 11 日建议书。

source: Baseline alignment
zh_cn: 基线对齐

source: Basic usage
zh_cn: 基本用法

source: Be Consistent
zh_cn: 保持一致

source: Be aware of common issues
zh_cn: 注意常见问题

source: Be careful about security leaks through the log.
zh_cn: 请务必谨慎，避免在日志中泄露安全方面的信息。

source: Be compatible with multiple Android platforms.
zh_cn: 与多个 Android 平台兼容。

source: Be lenient about moving outside of buttons
zh_cn: 宽容移动按钮之外

source: Because SwitchCompat does not extend Switch, you must explicitly declare SwitchMaterial in your layout XML.
zh_cn: 由于 SwitchCompat 未扩展 Switch，因此必须明确声明 SwitchMaterial 在你的布局 XML 中。

source: Because Android Studio only allows you to create transparent WebP images if your minSdkVersion is set to 18 or higher, the Skip images with transparency/alpha channel checkbox is automatically selected if your minSdkVersion is lower than 18.
zh_cn: 因为只有 minSdkVersion 设置为 18 或更高，Android Studio 才允许你创建透明 WebP 图像，所以如果你的 minSdkVersion 低于 18 Skip images with transparency/alpha channel 复选框会自动选中。

source: Because of the poor quality of this configuration, it is advised to use ARGB_8888 instead.
zh_cn: 由于此配置的质量较差，建议使用 ARGB_8888 来代替。

source: Because the work of Porter and Duff focuses solely on the effects of the alpha channel of the source and destination, the 12 operators described in the original paper are called alpha compositing modes here.
zh_cn: 由于 Porter 和 Duff 的工作仅关注源和目标的 alpha 通道的影响，原始文章中描述的 12 个操作符在这里被称为 alpha 合成模式。

source: Because this container is intended to better balance memory use, unlike most other standard Java containers it will shrink its array as items are removed from it.
zh_cn: 因为这个容器的目的是更好地平衡内存使用，不像大多数其他标准 Java 容器，它会在从中移除项时收缩数组。

source: Because we can't fully support color theming on all API levels for the BottomAppBar, to use the default theme, we are requiring you to opt in for now.
zh_cn: 因为我们无法在 BottomAppBar 的所有 API 级别上完全支持颜色主题，所以要使用默认主题，我们要求你立即选择加入。

source: Becoming detached from the window is not necessarily a permanent condition; the consumer of an Adapter's views may choose to cache views offscreen while they are not visible, attaching and detaching them as appropriate.
zh_cn: 从窗口中分离并不一定是一个永久性的条件；适配器 view 的使用者可以选择在 view 不可见时将其缓存到屏幕外，并根据需要附加和分离 view。

source: Before Lollipop, CardView adds padding to its content and draws shadows to that area.
zh_cn: 在 Lollipop 之前，CardView 会在其内容中添加 padding 并为该区域绘制阴影。

source: Before discussing how to reduce the size of your app, it's helpful to understand the structure of an app's APK.
zh_cn: 在讨论如何减小应用程序的大小之前，了解应用程序 APK 的结构会很有帮助。

source: Before you can call any drawing methods, though, it's necessary to create a Paint object.
zh_cn: 但是，在调用任何绘制方法之前，必须创建 Paint 对象。

source: Begin a nestable scroll operation along the given axes.
zh_cn: 沿给定轴开始嵌套滚动操作。

source: Begin a standard fling with an initial velocity along each axis in pixels per second.
zh_cn: 开始一个标准的 fling，包含各坐标轴的初始速度，单位是像素每秒。

source: Behavior designed for use with BottomAppBar instances.
zh_cn: 设计用于 BottomAppBar 实例的行为。

source: Behavior designed for use with FloatingActionButton instances.
zh_cn: 设计用于 FloatingActionButton 实例的行为。

source: Behavior which should be used by Views which can scroll vertically and support nested scrolling to automatically scroll any AppBarLayout siblings.
zh_cn: 应该由 View 使用的行为，它可以垂直滚动并支持嵌套滚动以自动滚动任何同级的 AppBarLayout。

source: Behaviors may be used to implement a variety of interactions and additional layout modifications ranging from sliding drawers and panels to swipe-dismissable elements and buttons that stick to other elements as they move and animate.
zh_cn: 行为(behavior)可用于实现各种交互和附加布局修改，比如实现滑动抽屉和滑动消失元素的面板，以及当其他元素移动和动画时粘附的按钮。

source: Below are the two buttons rendered from the XML and NinePatch image shown above.
zh_cn: 下面是 XML 文件和 NinePatch 图渲染出的结果。

source: Beware repeating too much code in the catch blocks.
zh_cn: 请注意，不要在 catch 块中过多地重复使用代码。

source: Beware that these methods may not be able to calculate adapter positions if RecyclerView.Adapter.notifyDataSetChanged() has been called and new layout has not yet been calculated.
zh_cn: 请注意，如果已调用 RecyclerView.Adapter.notifyDataSetChanged() 并且尚未计算新布局，则这些方法可能无法计算适配器位置。
